# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [2]:
# your answer here
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [3]:
# your answer here
employee = pd.read_csv('/Users/mariasoriano/Desktop/Ironhack/lab-pivot-table-and-correlation/your_code/data/Employee.csv')

In [4]:
employee

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [5]:
# Method 1 - USING GROUPBY
employee.groupby(['Department'])['Salary'].sum()

Department
HR       135
IT       195
Sales    110
Name: Salary, dtype: int64

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [6]:
# Method 2 - USING A PIVOT TABLE
pivot_table = employee.pivot_table(index=['Department'], columns=['Title'], values=['Salary'], fill_value = 0, aggfunc=np.sum, margins = True, margins_name = 'Total')
pivot_table

           Salary
Title          VP analyst associate Total
Department
HR             70      65         0   135
IT             70      65        60   195
Sales           0       0       110   110
Total         140     130       170   440

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [7]:
# your answer here
pivot_table2 = employee.pivot_table(index=['Title'], columns=['Years'], values=['Salary'], aggfunc='sum', fill_value = 0)
pivot_table2

          Salary
Years          1   2   3   4   7    8
Title
VP             0   0   0   0   0  140
analyst       35  60   0  35   0    0
associate      0  55  55   0  60    0

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [8]:
employee.pivot_table(index= ['Department','Title'], values = ['Salary'], aggfunc=['mean','count']).reset_index()

  Department      Title   mean  count
                        Salary Salary
0         HR         VP   70.0      1
1         HR    analyst   32.5      2
2         IT         VP   70.0      1
3         IT    analyst   32.5      2
4         IT  associate   60.0      1
5      Sales  associate   55.0      2

**I am not so sure of what "number of employees in each department" is asking for.. if that's based on the salary or just how many pple work in each department.
That's why I'm adding the following filters and counting the pple in each Department.**

In [9]:
# The mean salary
employee[['Salary']].mean()

Salary    48.888889
dtype: float64

In [10]:
# IT and Salary
it_employees = (employee['Department'] == 'IT')
employee.loc[it_employees]
# N of employees working at IT Dept = 4
employee[employee.Department == 'IT']['Name'].count()

4

In [11]:
# HR and Salary
hr_employees = (employee['Department'] == 'HR')
employee.loc[hr_employees]
# N of employees working at IT Dept = 3
employee[employee.Department == 'HR']['Name'].count()

3

In [12]:
# Sales and Salary
sales_employees = (employee['Department'] == 'Sales')
employee.loc[sales_employees]
# N of employees working at IT Dept = 2
employee[employee.Department == 'Sales']['Name'].count()

2

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [13]:
# My first thought was to use the describe() method
# But as we can see describe only takes into account numerical cols
# in this case we also need to see relation with categorical cols (Department and Title)
employee.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

In [14]:
# Let's do a pivot table then
describe_table = employee.pivot_table(index=['Department', 'Title'], values=['Salary'], aggfunc=[np.mean, min, max, np.std], fill_value = 0).reset_index()
describe_table

#how to round salary std to 2digit: .apply(lambda x: round(x,2))
# employee[('std','Salary')].apply(lambda x: round(x,2)

  Department      Title   mean    min    max       std
                        Salary Salary Salary    Salary
0         HR         VP   70.0     70     70       NaN
1         HR    analyst   32.5     30     35  3.535534
2         IT         VP   70.0     70     70       NaN
3         IT    analyst   32.5     30     35  3.535534
4         IT  associate   60.0     60     60       NaN
5      Sales  associate   55.0     55     55  0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [15]:
# Already filled them using 'fill_value = 0' for the NaNs
describe_table = employee.pivot_table(index=['Department', 'Title'], values=['Salary'], aggfunc=[np.mean, min, max, np.std], fill_value=0)
describe_table.head()

                       mean    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60       NaN

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [22]:
# Create a list that contains num of employees for each Department
employee.pivot_table(index= ['Department'], values = ['Salary'], aggfunc=['sum','count']).reset_index()

  Department    sum  count
             Salary Salary
0         HR    135      3
1         IT    195      4
2      Sales    110      2

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [23]:
# your answer here
employee_piv = employee.pivot_table(index= ['Department','Title'], values = ['Salary','Years'], aggfunc=['sum','mean']).reset_index()
employee_piv.drop(columns = [('sum','Salary'),('mean','Years')])

  Department      Title   sum   mean
                        Years Salary
0         HR         VP     8   70.0
1         HR    analyst     6   32.5
2         IT         VP     8   70.0
3         IT    analyst     3   32.5
4         IT  associate     7   60.0
5      Sales  associate     5   55.0

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [ ]:
# your answer here